## Python Libraries - Pandas - Merge and Append

In this section, you will merge and concatenate multiple dataframes. Merging is one of the most common operations you will do, since data often comes in various files.

### Merging

For merging, we have sales data across multiple sheets in an Excel file. We will now work with all these sheets and learn to:
* Merge multiple dataframes using common columns/keys using ```pd.merge()```

Let's first read all the data files.

In [1]:
# import the required libraries
import pandas as pd
import numpy as np

In [2]:
# read the sheets from file 'sales_returns.xlsx' into 2 different dataframes - orders and returns
orders = pd.read_excel("sales_return.xlsx", sheet_name = "orders")
returns = pd.read_excel("sales_return.xlsx", sheet_name = "Returns")

FileNotFoundError: [Errno 2] No such file or directory: 'sales_return.xlsx'

In [ ]:
# Check the shape of the dataframe 'orders'

In [ ]:
# Check the shape of the dataframe 'returns'

In [ ]:
# check the dataframe 'orders' and 'returns'

In [ ]:
# Create a dataframe 'return_orders' by merging the two dataframes on Order_ID


# Check the created dataframe

In [ ]:
# Check the shape of the new dataframe

In [ ]:
# try to use the 'left' method to join two dataframes


# Check the created dataframe

In [ ]:
# Check the orders where orders were returned

In [ ]:
# Print the dataframe summary using the info() command

In [ ]:
# Change the data type of the column 'Returned' 


# Check the dataframe after modification

In [ ]:
# Replace the 'nan' value with 'No' in the column 'Returned'


# Check the dataframe after modification

### Append / Concatenate

Concatenation is much more straightforward than merging. It is used when you have dataframes having the same columns and want to append them (pile one on top of the other), or having the same rows and want to append them side-by-side.

In [ ]:
# Import the required libraries

**Appending rows in a dataframe**

In [6]:
# Dataframes having the same columns

df1 = pd.DataFrame({'Name': ['Aman', 'Joy', 'Rashmi', 'Saif'],
                    'Age' : ['34', '31', '22', '33'], 
                    'Gender': ['M', 'M', 'F', 'M']}
                  )


df1

     Name Age Gender
0    Aman  34      M
1     Joy  31      M
2  Rashmi  22      F
3    Saif  33      M

In [8]:
df2 = pd.DataFrame({'Name': ['Akhil', 'Asha', 'Preeti'],
                    'Age' : ['31', '22', '23'], 
                    'Gender': ['M', 'F', 'F']}
                  )
df2

     Name Age Gender
0   Akhil  31      M
1    Asha  22      F
2  Preeti  23      F

In [9]:
# Append the rows of df2 in df1
df1.append(df2)

     Name Age Gender
0    Aman  34      M
1     Joy  31      M
2  Rashmi  22      F
3    Saif  33      M
0   Akhil  31      M
1    Asha  22      F
2  Preeti  23      F

**Appending columns in a dataframe**

In [10]:
# Another dataframe with same number of rows as df1
df3 = pd.DataFrame({'School': ['RK Public', 'JSP', 'Carmel Convent', 'St. Paul'],
                    'Graduation Marks': ['84', '89', '76', '91']}
                  )
df3

           School Graduation Marks
0       RK Public               84
1             JSP               89
2  Carmel Convent               76
3        St. Paul               91

In [11]:
# Concatenating the dataframes: df1 and df3
pd.concat([df1, df3])

     Name  Age Gender          School Graduation Marks
0    Aman   34      M             NaN              NaN
1     Joy   31      M             NaN              NaN
2  Rashmi   22      F             NaN              NaN
3    Saif   33      M             NaN              NaN
0     NaN  NaN    NaN       RK Public               84
1     NaN  NaN    NaN             JSP               89
2     NaN  NaN    NaN  Carmel Convent               76
3     NaN  NaN    NaN        St. Paul               91

In [12]:
# Concatenating the dataframes across column: df1 and df3
pd.concat([df1,df3], axis = 1)

     Name Age Gender          School Graduation Marks
0    Aman  34      M       RK Public               84
1     Joy  31      M             JSP               89
2  Rashmi  22      F  Carmel Convent               76
3    Saif  33      M        St. Paul               91